app/views/customers/show.html.erb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."customer_id" = ?  ORDER BY "accounts"."created_at" DESC  [["customer_id", 16]]
---
    <ul class="collapsible" data-collapsible="accordion">
      <% @customer.accounts.order(created_at: :desc).each do |account| %>