app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all.order(created_at: :desc).paginate(:page => params[:page], :per_page => 5)
---
SELECT  "accounts".* FROM "accounts"  ORDER BY "accounts"."created_at" DESC LIMIT 5 OFFSET 0

    def set_customers
      @customers = Customer.order(:name)
---
SELECT "customers".* FROM "customers"  ORDER BY "customers"."name" ASC