app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts"  ORDER BY "accounts"."created_at" DESC
SELECT COUNT(*) FROM "accounts"
---
  def index
    @accounts = Account.all.order(created_at: :desc)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @account = Account.new
    if params[:customer]
      @account.customer = Customer.find(params[:customer])

INSERT INTO "accounts" ("price", "salesman", "description", "status", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["price", 50.0], ["salesman", "lívia"], ["description", ""], ["status", 0], ["customer_id", 3], ["created_at", "2015-09-24 18:10:14.178603"], ["updated_at", "2015-09-24 18:10:14.178603"]]
---
  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save

UPDATE "accounts" SET "description" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["description", "descriptiondescriptiondescriptiondescriptiondescription"], ["updated_at", "2015-10-03 13:44:22.196810"], ["id", 53]]
---
  def update
    respond_to do |format|
      if @account.update(account_params)

DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 1]]
---
  def destroy
    @account.destroy

SELECT "customers".* FROM "customers"
---
    def set_customers
      @customers = Customer.all