app/controllers/cash_payments_controller.rb

SELECT "cash_payments".* FROM "cash_payments"
---
  def index
    @cash_payments = CashPayment.all