app/controllers/cash_payments_controller.rb

SELECT  "cash_payments".* FROM "cash_payments"  ORDER BY "cash_payments"."created_at" DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "cash_payments"
---
  def index
    @cash_payments = CashPayment.all.order(created_at: :desc).paginate(:page => params[:page], :per_page => 5)

INSERT INTO "cash_payments" ("salesman", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["salesman", "lívia"], ["price", 200.0], ["description", ""], ["created_at", "2015-10-01 13:15:17.142254"], ["updated_at", "2015-10-01 13:15:17.142254"]]
---
  def create
    @cash_payment = CashPayment.new(cash_payment_params)

    respond_to do |format|
      if @cash_payment.save

UPDATE "cash_payments" SET "description" = ?, "updated_at" = ? WHERE "cash_payments"."id" = ?  [["description", "testando"], ["updated_at", "2015-10-01 14:00:10.995500"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @cash_payment.update(cash_payment_params)

SELECT  "cash_payments".* FROM "cash_payments" WHERE "cash_payments"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_cash_payment
      @cash_payment = CashPayment.find(params[:id])