app/controllers/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE ("customers"."name" LIKE '%e%')  ORDER BY "customers"."name" ASC LIMIT 5 OFFSET 0
SELECT "accounts".* FROM "accounts" WHERE "accounts"."customer_id" IN (1, 2, 3, 6, 7, 8, 9)
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."customer_id" = ?  [["customer_id", 1]]
SELECT COUNT(*) FROM "customers"
---
  def index
    @q = Customer.ransack(params[:q])
    @customers = @q.result.order(:name).includes(:accounts).paginate(:page => params[:page], :per_page => 5)

INSERT INTO "customers" ("name", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Alisson"], ["email", "alisson@gmail.com"], ["phone", "83 87660617"], ["created_at", "2015-09-24 17:17:55.283145"], ["updated_at", "2015-09-24 17:17:55.283145"]]
---
  def create
    @customer = Customer.new(customer_params)
    authorize @customer
    respond_to do |format|
      if @customer.save

UPDATE "customers" SET "name" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["name", "patrick alisson"], ["updated_at", "2015-09-24 19:30:15.105853"], ["id", 8]]
---
  def update
    authorize @customer
    respond_to do |format|
      if @customer.update(customer_params)

DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 4]]
---
  def destroy
    authorize @customer
    @customer.destroy

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 16]]
---
  def pay_off
    if params[:customer]
      @customer = Customer.find(params[:customer])