app/controllers/profits_controller.rb

  def index
    Profit.destroy_all
---
DELETE FROM "profits" WHERE "profits"."id" = ?  [["id", 7]]