app/controllers/profits_controller.rb

DELETE FROM "profits" WHERE "profits"."id" = ?  [["id", 1]]
---
  def show
    if @profit.option == 'Day'
      @accounts = Account.search_day(@profit.date)
      @purchases = Purchase.search_day(@profit.date)
    elsif @profit.option == 'Week'
      @accounts = Account.search_week(@profit.date)
      @purchases = Purchase.search_week(@profit.date)
    elsif @profit.option == 'Month'
      @accounts = Account.search_month(@profit.date)
      @purchases = Purchase.search_month(@profit.date)
    elsif @profit.option == 'Year'
      @accounts = Account.search_year(@profit.date)
      @purchases = Purchase.search_year(@profit.date)
    end

    @total_sales = Profit.total_sales(@accounts)
    @total_collected = Profit.total_collected(@accounts)
    @total_spun = Profit.total_spun(@accounts)
    @total_spun = Profit.total_spun(@accounts)
    @total_purchases = Profit.total_purchases(@purchases)
    Profit.destroy_all

INSERT INTO "profits" ("option", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["option", "Year"], ["date", "2015-10-08"], ["created_at", "2015-10-08 13:02:38.939622"], ["updated_at", "2015-10-08 13:02:38.939622"]]
---
  def create
    @profit = Profit.new(profit_params)

    respond_to do |format|
      if @profit.save

SELECT  "profits".* FROM "profits" WHERE "profits"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_profit
      @profit = Profit.find(params[:id])