app/controllers/purchases_controller.rb

SELECT  "purchases".* FROM "purchases"  ORDER BY "purchases"."created_at" DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "purchases"
---
  def index
    @purchases = Purchase.order(created_at: :desc).paginate(:page => params[:page], :per_page => 5)

INSERT INTO "purchases" ("price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["price", 500.0], ["description", "reabastecendo o estoque."], ["created_at", "2015-10-06 21:22:31.165946"], ["updated_at", "2015-10-06 21:22:31.165946"]]
---
  def create
    @purchase = Purchase.new(purchase_params)
    authorize @purchase
    respond_to do |format|
      if @purchase.save

UPDATE "purchases" SET "description" = ?, "updated_at" = ? WHERE "purchases"."id" = ?
---
  def update
    authorize @purchase
    respond_to do |format|
      if @purchase.update(purchase_params)

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT 1  [["id", 8]]
---
    def set_purchase
      @purchase = Purchase.find(params[:id])